tests/com/l7tech/service/resources/websphereSignedRequest.xml

<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext" soapenv:actor="myActorURI" soapenv:mustUnderstand="1">
      <wsse:BinarySecurityToken xmlns:wsu="http://schemas.xmlsoap.org/ws/2003/06/utility" EncodingType="wsse:Base64Binary" ValueType="wsse:X509v3" wsu:Id="wssecurity_binary_security_token_id_2695368671990220329">
        MIICDDCCAXWgAwIBAgIIaKP9WE/58mUwDQYJKoZIhvcNAQEFBQAwGjEYMBYGA1UEAxMP
        cm9vdC53c2FkY2xpZW50MB4XDTA0MDgxMjE3MDIwN1oXDTA2MDgxMjE3MTIwN1owFTET
        MBEGA1UEAxMKd3NhZGNsaWVudDCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAsG+3
        9VfWJ8EHwsu0wOgI9unyBKvWmLTdEDOrVW64cHIMRRiI9/sMHsjavFahYVS4KbJ0zZlX
        Hw/b9eVxP024VBeRcCKGO2dkLw/8SiYkioKohSwRvezL6WRyJVBeUn6tmdSsY6mGrwsp
        cHS0XZVz2GB7/JxtMAprPAiivG6QyZ8CAwEAAaNgMF4wDAYDVR0TAQH/BAIwADAOBgNV
        HQ8BAf8EBAMCBaAwHQYDVR0OBBYEFCfmwd+y2wixrVqVdFPAeFX2o/PPMB8GA1UdIwQY
        MBaAFIhy5EpFdm51QydK4HSrpkSfFoMgMA0GCSqGSIb3DQEBBQUAA4GBAKe2+LWFVnxV
        RU/1719LU1vfwruII7Se0tUlWneV5mLVXJhzemw9ryshNi33ulU3TTC20W9ehiJ16+lc
        HKcL2b+bhoNd9fs/4H8KfSgwTXc3u+lxqtc2GfROki0JI+ne2hX0Cf2IXYlMEToGNaat
        vm9NCIaock1OyGH7lSXFrMYs
      </wsse:BinarySecurityToken>
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
          <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></CanonicalizationMethod>
          <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></SignatureMethod>
          <Reference URI="#wssecurity_body_id_4257849397624456567">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsi soapenc xsd #default wsu soapenv "></ec:InclusiveNamespaces>
              </Transform>
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
            <DigestValue>L5MNmENFHwCb8YxDxOPUIfWbXJs=</DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>
                ZMaJoxXIlHOR/J99GhUPxH75IjfqngY1gmTllWRV76tigo0YlzSK8FDfzUHP
                ymw9oyj5EAtOjD5LiBOTyt88TZ1I1SxXvrZvY+kpYW6wtPMj2PXkdOgCAIRr
                uGSjKAlsoJyBpU19cWitHGs8x9uaeqBILKp+TQ0dBLHTVet+3Ps=
        </SignatureValue>
        <KeyInfo>
          <wsse:SecurityTokenReference>
            <wsse:Reference URI="#wssecurity_binary_security_token_id_2695368671990220329"></wsse:Reference>
          </wsse:SecurityTokenReference>
        </KeyInfo>
      </Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://schemas.xmlsoap.org/ws/2003/06/utility" wsu:Id="wssecurity_body_id_4257849397624456567"><getTheTime xmlns="http://acpkg"></getTheTime></soapenv:Body></soapenv:Envelope>
